[
    {
        "name": "Lawful Good",
        "title": "Crusader",
        "description": "A lawful good character acts as a good person is expected or required to act. She combines a commitment to oppose evil with the discipline to fight relentlessly. She tells the truth, keeps her word, helps those in need, and speaks out against injustice. A lawful good character hates to see the guilty go unpunished.\n\nLawful good is the best alignment you can be because it combines honor and compassion.",
        "reasonToPlay": "Play a lawful good character if you enjoy being a paragon of virtue, upholding justice, and helping others, even at personal cost.",
        "examples": [
            "Superman (DC Comics)",
            "Aragorn (The Lord of the Rings)",
            "Captain America (Marvel Comics)",
            "Ned Stark (Game of Thrones)",
            "Prince Caspian (Chronicles of Narnia)"
        ]
    },
    {
        "name": "Neutral Good",
        "title": "Benefactor",
        "description": "A neutral good character does the best that a good person can do. He is devoted to helping others. He works with kings and magistrates but does not feel beholden to them.\n\nNeutral good is the best alignment you can be because it means doing what is good without bias for or against order.",
        "reasonToPlay": "Play a neutral good character if you want to be a caring and altruistic individual who aids others without being bound by strict rules or rigid structures.",
        "examples": [
            "Bilbo Baggins (The Hobbit)",
            "Harry Potter (Harry Potter series)",
            "Samwise Gamgee (The Lord of the Rings)",
            "Wonder Woman (DC Comics)",
            "Atticus Finch (To Kill a Mockingbird)"
        ]
    },
    {
        "name": "Chaotic Good",
        "title": "Rebel",
        "description": "A chaotic good character acts as his conscience directs him with little regard for what others expect of him. He makes his own way, but he’s kind and benevolent. He believes in goodness and right but has little use for laws and regulations. He hates it when people try to intimidate others and tell them what to do. He follows his own moral compass, which, although good, may not agree with that of society.\n\nChaotic good is the best alignment you can be because it combines a good heart with a free spirit.",
        "reasonToPlay": "Play a chaotic good character if you're drawn to rebellion against authority, valuing personal freedom, and championing the cause of the downtrodden.",
        "examples": [
            "Robin Hood (Various adaptations)",
            "Malcolm Reynolds (Firefly)",
            "V (V for Vendetta)",
            "The Doctor (Doctor Who)",
            "Han Solo (Star Wars)"
        ]
    },
    {
        "name": "Lawful Neutral",
        "title": "Judge",
        "description": "A lawful neutral character acts as law, tradition, or a personal code directs her. Order and organization are paramount to her. She may believe in personal order and live by a code or standard, or she may believe in order for all and favor a strong, organized government.\n\nLawful neutral is the best alignment you can be because it means you are reliable and honorable without being a zealot.",
        "reasonToPlay": "Play a lawful neutral character if you're interested in maintaining stability, upholding laws, and finding value in order and structure.",
        "examples": [
            "Judge Dredd (2000 AD Comics)",
            "Sherlock Holmes (Various adaptations)",
            "Agent Smith (The Matrix)",
            "Hermione Granger (Harry Potter series)",
            "Rorschach (Watchmen)"
        ]
    },
    {
        "name": "Neutral",
        "title": "Undecided",
        "description": "A neutral character does what seems to be a good idea. She doesn’t feel strongly one way or the other when it comes to good vs. evil or law vs. chaos. Most neutral characters exhibit a lack of conviction or bias rather than a commitment to neutrality. Such a character thinks of good as better than evil—after all, she would rather have good neighbors and rulers than evil ones. Still, she’s not personally committed to upholding good in any abstract or universal way.\n\nSome neutral characters, on the other hand, commit themselves philosophically to neutrality. They see good, evil, law, and chaos as prejudices and dangerous extremes. They advocate the middle way of neutrality as the best, most balanced road in the long run.\n\nNeutral is the best alignment you can be because it means you act naturally, without prejudice or compulsion.",
        "reasonToPlay": "Play a neutral character if you're interested in exploring a balanced approach, considering each situation independently, and avoiding extreme viewpoints.",
        "examples": [
            "Buffy Summers (Buffy the Vampire Slayer)",
            "Indiana Jones (Indiana Jones series)",
            "Marty McFly (Back to the Future)",
            "Frodo Baggins (The Lord of the Rings)",
            "Dexter Morgan (Dexter)"
        ]
    },
    {
        "name": "Chaotic Neutral",
        "title": "Free Spirit",
        "description": "A chaotic neutral character follows his whims. He is an individualist first and last. He values his own liberty but doesn’t strive to protect others’ freedom. He avoids authority, resents restrictions, and challenges traditions. A chaotic neutral character does not intentionally disrupt organizations as part of a campaign of anarchy. To do so, he would have to be motivated either by good (and a desire to liberate others) or evil (and a desire to make those different from himself suffer). A chaotic neutral character may be unpredictable, but his behavior is not totally random. He is not as likely to jump off a bridge as to cross it.\n\nChaotic neutral is the best alignment you can be because it represents true freedom from both society’s restrictions and a do-gooder’s zeal.",
        "reasonToPlay": "Play a chaotic neutral character if you want to embrace unpredictability, challenge societal norms, and value personal independence above all else.",
        "examples": [
            "Jack Sparrow (Pirates of the Caribbean)",
            "The Joker (DC Comics)",
            "Tyler Durden (Fight Club)",
            "Deadpool (Marvel Comics)",
            "Q (Star Trek: The Next Generation)"
        ]
    },
    {
        "name": "Lawful Evil",
        "title": "Dominator",
        "description": "A lawful evil villain methodically takes what he wants within the limits of his code of conduct without regard for whom it hurts. He cares about tradition, loyalty, and order but not about freedom, dignity, or life. He plays by the rules but without mercy or compassion. He is comfortable in a hierarchy and would like to rule, but is willing to serve. He condemns others not according to their actions but according to race, religion, homeland, or social rank. He is loath to break laws or promises. This reluctance comes partly from his nature and partly because he depends on order to protect himself from those who oppose him on moral grounds. Some lawful evil villains have particular taboos, such as not killing in cold blood (but having underlings do it) or not letting children come to harm (if it can be helped). They imagine that these compunctions put them above unprincipled villains.\n\nSome lawful evil people and creatures commit themselves to evil with a zeal like that of a crusader committed to good. Beyond being willing to hurt others for their own ends, they take pleasure in spreading evil as an end unto itself. They may also see doing evil as part of a duty to an evil deity or master.\n\nLawful evil is sometimes called “diabolical,” because devils are the epitome of lawful evil.\n\nLawful evil is the most dangerous alignment because it represents methodical, intentional, and frequently successful evil.",
        "reasonToPlay": "Play a lawful evil character if you're intrigued by power, control, and manipulation, and are willing to pursue your goals with cunning and a disregard for morality.",
        "examples": [
            "Darth Vader (Star Wars)",
            "Lord Voldemort (Harry Potter series)",
            "Jafar (Aladdin)",
            "Cersei Lannister (Game of Thrones)",
            "Sauron (The Lord of the Rings)"
        ]
    },
    {
        "name": "Neutral Evil",
        "title": "Malefactor",
        "description": "A neutral evil villain does whatever she can get away with. She is out for herself, pure and simple. She sheds no tears for those she kills, whether for profit, sport, or convenience. She has no love of order and holds no illusion that following laws, traditions, or codes would make her any better or more noble. On the other hand, she doesn’t have the restless nature or love of conflict that a chaotic evil villain has.\n\nSome neutral evil villains hold up evil as an ideal, committing evil for its own sake. Most often, such villains are devoted to evil deities or secret societies.\n\nNeutral evil is the most dangerous alignment because it represents pure evil without honor and without variation.",
        "reasonToPlay": "Play a neutral evil character if you're interested in embodying ruthless ambition, self-interest, and a willingness to manipulate and harm others for personal gain.",
        "examples": [
            "Cruella de Vil (101 Dalmatians)",
            "Bellatrix Lestrange (Harry Potter series)",
            "The Governor (The Walking Dead)",
            "Hannibal Lecter (The Silence of the Lambs)",
            "Maleficent (Sleeping Beauty)"
        ]
    },
    {
        "name": "Chaotic Evil",
        "title": "Destroyer",
        "description": "A chaotic evil character does whatever his greed, hatred, and lust for destruction drive him to do. He is hot-tempered, vicious, arbitrarily violent, and unpredictable. If he is simply out for whatever he can get, he is ruthless and brutal. If he is committed to the spread of evil and chaos, he is even worse. Thankfully, his plans are haphazard, and any groups he joins or forms are poorly organized. Typically, chaotic evil people can be made to work together only by force, and their leader lasts only as long as he can thwart attempts to topple or assassinate him.\n\nChaotic evil is sometimes called “demonic” because demons are the epitome of chaotic evil.\n\nChaotic evil is the most dangerous alignment because it represents the destruction not only of beauty and life but also of the order on which beauty and life depend.",
        "reasonToPlay": "Play a chaotic evil character if you're drawn to chaos, destruction, and the pursuit of your own desires at the expense of others.",
        "examples": [
            "The Joker (DC Comics)",
            "Sauron (The Lord of the Rings)",
            "Freddy Krueger (A Nightmare on Elm Street)",
            "The Wicked Witch of the West (The Wizard of Oz)",
            "Pennywise the Dancing Clown (Stephen King's It)"
        ]
    }
]