


    [
    {
        "name": "Master of Many Forms",
        "hitDie": "d8",
        "skillPoints": "4 + Int",
        "spellCasting": "None",
        "baseAttackBonus": "Medium",
        "saves": {
            "Fortitude": "High",
            "Reflex": "Low",
            "Will": "Low"
        },
        "classFeatures": [
            {
                "name": "Weapon and Armor Proficiency",
                "level": "N/A",
                "description": "Masters of many forms gain no proficiency with any weapon or armor."
            },
            {
                "name": "Shifter's Speech",
                "level": "N/A",
                "description": "A master of many forms maintains her ability to speak normally (including verbal components of spells) regardless of the form she takes. She can communicate with other creatures of the same kind while in wild shape, as long as such creatures are normally capable of communicating with each other using natural methods."
            },
            {
                "name": "Improved Wild Shape",
                "level": 1,
                "description": "A master of many forms knows how to use her wild shape ability to assume a wider range of forms. She can assume a humanoid form with wild shape. She later gains the ability to assume the form of a giant, a monstrous humanoid, a fey, a vermin, an aberration, a plant, an ooze, an elemental, and a dragon. The size limit of the shapes she can assume also increases with her levels."
            },
            {
                "name": "Fast Wild Shape",
                "level": 3,
                "description": "Starting at 3rd level, a master of many forms can use her wild shape ability as a move action, rather than as a standard action."
            },
            {
                "name": "Extraordinary Wild Shape",
                "level": 7,
                "description": "Starting at 7th level, a master of many forms gains the extraordinary special qualities of any form she assumes with wild shape."
            },
            {
                "name": "Evershifting Form",
                "level": 10,
                "description": "A 10th-level master of many forms gains the shapechanger subtype, becomes immune to any transmutation effect unless willing, no longer takes ability penalties for aging, and is not subject to magical aging. Bonuses still accrue, and she still dies of old age when her time is up."
            }
        ],
        "classSkills": {
            "Climb": "STR",
            "Concentration": "CON",
            "Craft": "INT",
            "Diplomacy": "CHA",
            "Disguise": "CHA",
            "Handle Animal": "CHA",
            "Hide": "DEX",
            "Jump": "STR",
            "Knowledge (nature)": "INT",
            "Listen": "WIS",
            "Spot": "WIS",
            "Survival": "WIS",
            "Swim": "STR"
        },
        "requirements": {
            "Feats": ["Alertness", "Endurance"],
            "Special": "Wild shape class feature."
        }
    }
]

